rating = int(input("Введите рейтинг продукта (1-10): "))

match rating:
    case 9 | 10:
        print("Описание: Отличный")
        print("Emoji: 🤩")
        print("Рекомендация: Рекомендую")

    case 7 | 8:
        print("Описание: Хороший")
        print("Emoji: 😊")
        print("Рекомендация: Рекомендую")

    case 5 | 6:
        print("Описание: Средний")
        print("Emoji: 😐")
        print("Рекомендация: Можно попробовать")

    case 1 | 2 | 3 | 4:
        print("Описание: Плохой")
        print("Emoji: 😞")
        print("Рекомендация: Не рекомендую")

    case _:
        print("Ошибка: рейтинг должен быть от 1 до 10")
